Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་པད་མ་ལྟར་གས་པ་ཆེན་པོར་སྐྱེས་སོ། །
en: He plummeted to the lower realms and took rebirth as a being in the Great Lotus Hell.

source: དེ་དེར་སྐྱེས་ནས་ཆེར་གྱུར་ཏེ་ལུས་དཔག་ཚད་མང་པོ་དང་ལྡན་པས་ཁྱབ་པར་འདུག་གོ། །
en: Taking birth there, he had a body so large it extended for many yojanas.

source: དེ་ནས་དེའི་ལས་ལས་སྐྱེས་པའི་མི་དག་གིས་ཁ་ནས་ལྕེ་ཕྱུང་སྟེ།
en: There, due to his past actions, human beings appeared and tore his tongue from his mouth.

source: ལྕགས་ཀྱིས་གཞི་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་ཏུ་རབ་ཏུ་འབར་བའི་སྟེང་དུ་ལྕགས་ཀྱི་ཕུར་པ་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་ཏུ་རབ་ཏུ་འབར་ཏེ་
en: There were iron daggers on the molten iron that drenched the floor, which was on fire, burning all over, and covered in flames.

source: མེ་ལྕེ་གཅིག་ཏུ་འབར་བ་ཤ་སྟག་གིས་བརྒྱངས་ནས་དེའི་ལྕེ་དེ་ལ་རྨོན་པ་དོར་ལྔ་བརྒྱ་བྱུང་སྟེཐམས་ཅད་ཀྱང་འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་ཏུ་རབ་ཏུ་འབར་ཏེ་མེ་ལྕེ་གཅིག་ཏུ་འབར་བ་ཤ་སྟག་གོ། །
en: These too were on fire, burning all over, and covered in flames—they were nothing but a single, searing flame. On his tongue drove five hundred yokes of oxen, and they too were all on fire, burning all over, and covered in flames—they were nothing but a single, searing flame.

source: ལས་ལས་སྐྱེས་པའི་རྨོན་གླང་དེ་དག་གི་རྨིག་པ་ཡང་སྤུ་གྲིའི་སོ་འདྲ་སྟེ། འབར་ཞིང་རབ་ཏུ་འབར་ལ་ཀུན་ཏུ་རབ་ཏུ་འབར་ཏེ། མེ་ལྕེ་གཅིག་ཏུ་འབར་བ་ཤ་སྟག་སྟེ།
en: These yokes of oxen, which arose due to his past actions, had hooves like the edge of a razor, which were also on fire, burning all over, and covered in flames—they were nothing but a single, searing flame.

source: དེ་དག་གིས་ཕྱོགས་གང་དང་གང་དུ་གོམ་པ་བོར་བའི་ཕྱོགས་དེ་དང་དེར་ཀུན་ཏུ་གཅོད་ཅིང་ཀུན་ཏུ་གཏུབ་ལ་ཀུན་དུ་དམྱལ་བར་བྱེད་དོ། །
en: They caused him infernal torment, for no matter what direction they trod, they cut and hacked at him all over.

source: དེའི་ཁོ་ར་ཁོར་ཡུག་ནས་ཀྱང་ལྕགས་ཀྱི་མཆེ་བ་ཅན་གྱི་ཁྱི་དང་སེང་གེ་དང་སྟག་དང་གཟིག་དང་དོམ་དང་དྲེད་ལ་སོགས་པ་དག་ལྷགས་ནས། ལུས་ལས་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བྱེད་དོ། །
en: From all around there fell upon him iron-fanged dogs, lions, tigers, leopards, bears, and hyenas, who tore into his flesh over and over again and fed on him.

source: སྟེང་གི་ནམ་མཁའ་ལས་ཀྱང་ལྕགས་ཀྱི་མཆུ་ཅན་གྱི་བྱ་རྒོད་དང་བྱ་རོག་དང་ཆུན་ལག་རྣམས་ལྷགས་ནས་ཤ་རྣམས་བཅད་ཅིང་བཅད་ཅིང་ཟ་བར་བྱེད་དེ།
en: Iron-beaked vultures, crows, and ospreys came from the sky above him and also tore into his flesh over and over again and fed on him.

source: གཞི་དེས་ན་དེས་སྡུག་བསྔལ་དྲག་པ་དང་མི་བཟད་པ་དང་ཚ་བའི་ཚོར་བ་ཉམས་སུ་མྱོང་སྟེ་སྐད་ངན་ཆེན་པོ་འདོན་ཏོ། །
en: This caused him dreadful suffering and extreme, excruciating, unbearable agony, and he let loose a great cry.

source: དེ་ནས་ལྷ་ཁ་དོག་འཕགས་པ་གསུམ་ནམ་སྲོས་པ་ན། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: Now as night fell, three gods of noble complexion came to see the Blessed One.

source: ལྷགས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: Upon their arrival they touched their heads to his feet and took seats to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ལྷ་གཅིག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After they had taken their seats to one side, one god informed the Blessed One,

source: བཙུན་པ་ལྷ་སྦྱིན་གྱི་ཕྱོགས་སུ་གཏོགས་པའི་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ནི་གུམ་ལགས་སོ། །
en: “Lord, the one who sided with Devadatta—the monk Kokālika—has passed away.”

source: ལྷ་གཅིག་གིས་གསོལ་པ། བཙུན་པ་དགེ་སློང་དེས་ནི་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་སྡང་བའི་སེམས་བསྐྱེད་པས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་པད་མ་ལྟར་གས་པ་ཆེན་པོར་སྐྱེས་ལགས་སོ། །
en: Another god added, “Lord, that monk felt such hatred toward Śāriputra and Maudgalyāyana that he was born as a hell being in the Great Lotus Hell.”

source: ལྷ་གཅིག་གིས་ནི་དེའི་ཚེ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then the other god said in verse,

source: སྐྱེས་བུ་གཅིག་ཅིག་སྐྱེས་པ་ན། །ཁ་ནས་སྟ་རེ་བྱུང་བར་གྱུར། །
en: “When certain people are born, a hatchet Comes swinging from their mouths.

source: ཉེས་པར་སྨྲ་བའི་ཚིག་བརྗོད་པ། །དེས་ནི་བདག་ཉིད་གཅོད་པར་བྱེད། །
en: Those who lash out with words of blame Cut only themselves down.

source: གང་ཞིག་དམད་འོས་སྐྱེ་བོ་བསྔགས་པ་དང་། །བསྔགས་པར་འོས་པའི་སྐྱེ་བོ་དམོད་བྱེད་པ། །དེས་ནི་ཁ་ནས་རྩོད་པ་དེ་བསགས་ཏེ། །རྩོད་པ་དེས་ན་བདེ་བ་མྱོང་མི་འགྱུར། །
en: “A torrent pouring from the mouth Carries off the joy of those Who praise the virtues of the blameful And vilify those not to blame.

source: འདི་ན་ཆོ་ལོས་བདག་སྐུགས་ཕམ་པའི་ཚེ། །རྩོད་པ་གང་ཡིན་དེ་ནི་ཆུང་བ་ཡིན། །
en: “A wager lost, the gamblers bicker— Fights over dice are fairly small.

source: བདེ་བར་གཤེགས་པ་ལ་སེམས་སྡང་བ་ཡི། །རྩོད་པ་གང་ཡིན་དེ་ནི་ཤིན་ཏུ་ཆེ། །
en: But the trouble brought to a mind that hates Those Gone to Bliss is enormous.

source: ངག་དང་ཡིད་ཀྱིས་སྡིག་བྱས་འཕགས་ལ་དམད། །དེས་ན་ལོ་གྲངས་དུང་ཕྱུར་ཕྲག་འབུམ་དང་། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་རྩ་ལྔའི་བར། །སེམས་ཅན་དམྱལ་བ་ཉམས་སུ་མྱོང་བར་འགྱུར། །
en: “Because with evil speech and mind They cursed the Noble Ones, For 1,350,000,000 years They’ll circle through the hells.”

source: ལྷ་གསུམ་གྱིས་དེ་སྐད་ཅེས་སྨྲས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: After the three gods had spoken thus, they disappeared.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མཚན་མོ་དེ་འདས་ནས། དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: When night had passed, the Blessed One took his place on the seat prepared for him amid the saṅgha of monks.

source: བཞུགས་ནས་ཀྱང་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: After taking his place, the Blessed One said,

source: དགེ་སློང་དག་མདང་སུམ་ནམ་སྲོས་ན་ལྷ་ཁ་དོག་འཕགས་པ་གསུམ་ང་ག་ལ་བ་དེར་འོངས་ཏེ་ལྷགས་ནས། ངའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: “Monks, yesterday, as night fell, three gods of noble complexion came to see the Blessed One, and upon their arrival they touched their heads to his feet and took seats to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ལྷ་གཅིག་གིས་ང་ལ་གསོལ་པ།
en: After they had taken their seats to one side, one god told the Blessed One,

source: ལྷ་གཅིག་གིས་གསོལ་པ།
en: “Another god said,

source: བཙུན་པ་དགེ་སློང་དེས་ནི་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་སྡང་བའི་སེམས་བསྐྱེད་པས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་པད་མ་ལྟར་གས་པ་ཆེན་པོར་སྐྱེས་ལགས་སོ། །
en: ‘Lord, that monk felt such hatred toward Śāriputra and Maudgalyāyana that he was born as a hell being in Great Lotus Hell.’

source: དགེ་སློང་དག་གཞན་ཡང་ཁྱེད་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ཆུ་བུར་ཅན་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་ཉན་པར་འདོད་དམ།
en: “Monks, do you wish to hear the lifespan of beings born as hell beings in the Blistering Hell again?”

source: དགེ་སློང་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ཆུ་བུར་ཅན་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་བསྟན་པའི་དུས་ནི་བཅོམ་ལྡན་འདས་འདི་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དུས་ནི་འདི་ལགས་སོ་ཞེས་གསོལ་ཏོ། །
en: “Blessed One,” the monks replied, “it is time for the Blessed One teach us the lifespan of beings born as hell beings in the Blistering Hell.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་བཞིན་དུ།
en: Yes, Sugata, it is time.”

source: དགེ་སློང་རྣམས་ཀྱིས་མཉན་ནས། དགེ་སློང་དག་འོ་ན་ལེགས་པར་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: The monks listened as the Blessed One spoke, saying, “In that case, monks, listen well and bear it in mind, and I shall tell you.

source: དགེ་སློང་དག་དཔེར་ན། ཡུལ་ཀོ་ས་ལའི་ཏིལ་གྱི་བང་བ། ཏིལ་ཁལ་བཅུ་ཚད་ཉི་ཤུ་ཤོང་བ་ཏིལ་གྱིས་བཀང་སྟེ། བྱུར་བུར་སྦྱུར་བ་དེ་ལས་མི་ལ་ལ་ཞིག་གིས་ལོ་བརྒྱ་བརྒྱ་ལོན་ཞིང་ཏིལ་འབྲུ་གཅིག་གུད་དུ་བོར་ན། དགེ་སློང་དག་ཡུལ་ཀོ་ས་ལའི་ཏིལ་གྱི་བང་བ་ཏིལ་ཁལ་བཅུ་ཚད་ཉི་ཤུ་པ་དེ་ནི། ཐབས་དེ་ལྟ་བུས་ཆེས་མྱུར་དུ་ཡོངས་སུ་ཟད་ཅིང་མཐར་ཐུག་པར་འགྱུར་གྱི།
en: “As an example, monks, if someone were to set aside one grain every ten thousand years from Kośala’s storehouse of sesame grain, which contains twenty ten-bushel vessels filled to the brim with sesame grains, one could exhaust Kośala’s twenty ten-bushel storehouse of sesame grain relatively quickly and complete the task.

source: སེམས་ཅན་དམྱལ་བ་ཆུ་བུར་ཅན་དུ་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ཀྱི་ཚེའི་ཚད་ནི་ཟད་པར་འགྱུར་རོ་ཞེས་ང་མི་ཟེར་རོ། །
en: But I cannot say, monks, that in that time a single lifespan of a being who is born among the hell beings in the Blistering Hell would be exhausted.

source: ཆུ་བུར་ཅན་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་ཆུ་བུར་རྡོལ་གཅིག་གི་ཚད་དོ། །
en: “Twenty lifetimes of a hell being in the Blistering Hell are equal to a single lifetime in the Bursting Blister Hell.

source: ཆུ་བུར་རྡོལ་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་སོ་ཐམས་ཐམས་གཅིག་གི་ཚད་དོ། །
en: Twenty lifetimes in the Bursting Blister Hell are equal to a single lifetime in the Chattering Teeth Hell.

source: སོ་ཐམས་ཐམས་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་ཀྱི་ཧུད་ཟེར་གཅིག་གི་ཚད་དོ། །
en: Twenty lifetimes in the Chattering Teeth Hell are equal to a single lifetime in the Hell of Lamentation.

source: ཀྱི་ཧུད་ཟེར་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་ཨ་ཆུ་ཟེར་གཅིག་གི་ཚད་དོ། །
en: Twenty lifetimes in the Hell of Lamentation are equal to a single lifetime in the Cold Whimpering Hell.

source: ཨ་ཆུ་ཟེར་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་དེ་ནི་ཨུད་པ་ལ་ལྟར་གས་པ་གཅིག་གི་ཚད་དོ། །
en: Twenty lifetimes in the Cold Whimpering Hell are equal to a single lifetime in the Blue Lotus Hell.

source: ཨུད་པ་ལ་ལྟར་གས་པ་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་པད་མ་ལྟར་གས་པ་གཅིག་གི་ཚད་དོ། །
en: Twenty lifetimes in the Blue Lotus Hell are equal to a single lifetime in the Lotus Hell.

source: པད་མ་ལྟར་གས་པ་ཉི་ཤུའི་ཚད་ཇི་ཙམ་པ་ནི་པད་མ་ལྟར་གས་པ་ཆེན་པོ་གཅིག་གི་ཚད་ཡིན་ཏེ།
en: Twenty lifetimes in the Lotus Hell are equal to a single lifetime in the Great Lotus Hell.

source: ལྷ་སྦྱིན་གྱི་ཕྱོགས་སུ་གཏོགས་པའི་དགེ་སློང་ཀོ་ཀ་ལི་ཀས། དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ། སེམས་སྡང་བར་བྱས་པས་དེར་སྐྱེས་སོ། །
en: And now the one who has sided with Devadatta, the monk Kokālika, has taken rebirth there because he felt such hatred toward Śāriputra and Maudgalyāyana.

source: དགེ་སློང་དག་དེ་བས་ན་ཐ་ན་སྡོང་དུམ་མེ་རེག་མ་ལ་ཡང་སྙིང་ན་བ་མེད་པར་བྱ་ན་རྣམ་པར་ཤེས་པ་དང་ལྡན་པ་ལ་ལྟ་ཅི་སྨོས་ཞེས་དགེ་སློང་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: “That is why, monks, you should train as follows: ‘One should not feel hostile toward so much as a burnt log, let alone a conscious being.’

source: དགེ་སློང་དག་གཞན་ཡང་གང་ཟག་གིས་གང་ཟག་གི་ཚོད་མ་བཟུང་ཤིག །
en: Furthermore, monks, one should not draw conclusions about others.

source: དགེ་སློང་དག་གང་ཟག་གིས་གང་ཟག་གི་ཚོད་བཟུང་ན་ཉམས་པར་འགྱུར་རོ། །
en: Monks, those who draw conclusions about others will be lost.

source: དགེ་སློང་དག་ངའམ་ང་དང་འདྲ་བས་ནི་གང་ཟག་གི་ཚོད་གཟུང་དུ་རུང་ངོ་། །
en: Monks, it is only suitable for me and those like me to draw conclusions.

source: དགེ་སློང་དག་དེ་བས་ན། གང་ཟག་གིས་གང་ཟག་གི་ཚོད་གཟུང་བར་བྱ་ན། གང་ཟག་དེས་ནི་གང་ཟག་དེ་ལ་རྒྱུ་རྣམ་པ་བརྒྱད་ཀྱིས་བརྟག་པར་བྱ་སྟེ།
en: Instead of drawing conclusions about others, monks, one should look for the eight different causes for their behavior.

source: སྤྱོད་པ་དང་སྤྱོད་ཡུལ་དང་མཛའ་བོ་དང་གྲོགས་པོ་དང་འཚོ་བ་དང་ཐོས་པ་དང་ལུས་ཀྱི་ལས་དང་ངག་གི་ལས་ལས་བརྟག་པར་བྱའོ། །
en: One should look at (1) their comportment, (2) the scope of their activities, (3) their spouses, (4) their friends, (5) their livelihood, (6) their learning, (7) what they do, and (8) what they say.

source: དེ་ལྟར་བརྟགས་ན་དེ་ལ་སྙིང་ན་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ཕྱིར་ལྡོག་པར་འགྱུར་རོ། །
en: Upon such analysis, all hostility will be eliminated.

source: དགེ་སློང་དག་དེ་བས་ན་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ།
en: Therefore, monks, you should train yourselves in this:

source: ཐ་ན་སྡོང་དུམ་མེ་རེག་མ་ལ་ཡང་བདག་ཅག་གིས་སེམས་སྡང་བར་མི་བྱ་ན། རྣམ་པར་ཤེས་པ་དང་ལྡན་པ་ལ་ལྟ་ཅི་སྨོས་ཞེས་དགེ་སློང་དག་ཁྱེད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: ‘One should not feel hostile toward so much as a burnt log, let alone a conscious being.’ ”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། དེའི་སྐབས་སུ་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱིས་བསམས་པ།
en: After he had said this, Śāriputra and Maudgalyāyana thought,

source: བདག་ཅག་གཉིས་ཀྱིས་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་བརྟག་པར་བྱའོ་སྙམ་སྟེ་
en: “We should check on the monk Kokālika.”

source: འོད་མའི་ཚལ་ནས་མི་སྣང་བར་གྱུར་ནས
en: They disappeared from Bamboo Grove

source: སེམས་ཅན་དམྱལ་བ་པད་མ་ལྟར་གས་པ་ཆེན་པོར་སོང་སྟེ་དེ་གཉིས་དེར་ཕྱིན་ནས་བལྟས་ན་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་དེ་ལྟ་བུར་འདུག་པ་མཐོང་ངོ་། །
en: and traveled to the Great Lotus Hell. Upon their arrival they looked around and saw there was one who looked like the monk Kokālika.

source: མཐོང་ནས་ཀྱང་དེ་ཁོ་ན་ལ་སྙིང་བརྩེ་བའི་སེམས་ཉེ་བར་བཞག་སྟེ་ཀོ་ཀ་ལི་ཀ་ག་ལ་བ་དེར་དོང་ངོ་། །
en: After they saw him, they approached with their compassionate minds completely focused on him.

source: དེ་ནས་ཀོ་ཀ་ལི་ཀས་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཐག་རིང་པོ་ཞིག་ནས་མཐོང་ངོ་། །
en: Kokālika saw Śāriputra and Maudgalyāyana from a distance,

source: མཐོང་ནས་ཀྱང་དེ་དེ་གཉིས་ལ་ལྷག་པར་སྙིང་ན་བར་གྱུར་ཏེ།
en: and when he saw them, he felt particular hostility toward them both.

source: བདག་འདིར་སྐྱེས་ན་ཡང་སྡིག་པ་ལ་དགའ་བ་སྡིག་པའི་ཆོས་དང་ལྡན་པ་འདི་གཉིས་ཀྱིས་མ་བཏང་ངོ་སྙམ་མོ། །
en: “Even when I am born here I am still not free of these two who revel in sin and are sinful.”

source: དེ་ནས་དེ་སེམས་འཁྲུགས་མ་ཐག་ཏུ་དེའི་ལྕེ་ལ་རྨོན་པ་དོར་སྟོང་བྱུང་ངོ་། །
en: No sooner did his mind begin to rage than a hundred thousand yokes of oxen appeared on his tongue.

source: དེ་ནས་དེ་གཉིས་ཀྱིས་བསམས་པ།
en: The two of them thought,

source: ཀྱི་ཧུད་མི་བླུན་པོ་འདི་ནི་གསོར་མེད་དོ་སྙམ་ནས།
en: “Alas, there is no curing this deluded man.”

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་པད་མ་ལྟར་གས་པ་ཆེན་པོ་ནས་མི་སྣང་བར་གྱུར་ཏེ་འོད་མའི་ཚལ་དུ་སོང་ངོ་། །
en: They disappeared from the Great Lotus Hell and traveled back to Bamboo Grove,

source: དེ་གཉིས་དེར་ཕྱིན་ནས་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་སྐྱོ་བ་བསྐྱེད་པའི་ཕྱིར་དེ་ན་དེའི་གནོད་པ་ཅི་འདྲ་བ་དེ་དག་དེ་ཁོ་ན་བཞིན་དུ་བསྙད་དོ། །
en: and when they arrived there, in order that their fellow practitioners of the holy life might become disillusioned with saṃsāra, they explained in detail the harms he had undergone.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་རྣམས་ཤས་ཆེར་སྐྱོ་བ་སྐྱེས་སོ། །
en: As soon as they heard this, the people gathered there welled up with grief.

source: དེ་ནས་དེ་གཉིས་ཀྱིས་དེ་དག་སྐྱོ་བར་གྱུར་པ་སེམས་ཀྱིས་རིག་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ། དེས་ན་འཁོར་དེ་དག་ལས་ཁ་ཅིག་གིས་ནི་དྲོ་བར་གྱུར་པ་བསྐྱེད་དོ། །
en: The two of them understood the grief they felt and taught them the Dharma accordingly, and among the assembled some generated heat right where they sat.

source: འཁོར་དེ་དག་གི་ནང་ནས་ཕལ་ཆེར་ནི་སངས་རྒྱས་ལ་གཞོལ། ཆོས་ལ་འབབ། དགེ་འདུན་ལ་བབ་པར་བྱས་ཏེ་བཀོད་དོ། །
en: Among the assembled, most found themselves drawn to the Buddha, intent on the Dharma, and favoring the Saṅgha.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: Then the monks then requested of the Blessed One,

source: བཙུན་པ་གཟིགས་ལགས། དགེ་སློང་ཀོ་ཀ་ལི་ཀས་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་སེམས་སྡང་བར་བགྱིས་ནསསེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ལགས་སོ། །
en: “Lord, tell us why the monk Kokālika felt hatred toward the monks Śāriputra and Maudgalyāyana, and has now fallen among the hell beings.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ་འདས་པའི་དུས་ན་ཡང་འདིས་འདི་གཉིས་ཁོ་ན་ལ་སེམས་སྡང་བར་བྱས་པས་ཇི་ལྟར་སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་པ་དེ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well he intended malice toward these two and fell among the hell beings. Listen well!

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་འཐབ་མེད་ཅེས་བྱ་བ་ན། རྒྱལ་པོ་སྡེ་ཆེན་པོ་ཞེས་བྱ་བ་རྒྱལ་པོ་བྱེད་དེ།
en: “Monks, in times gone by, King Mahā­sena reigned in the city of Ayodhyā.

source: རྒྱལ་པོ་སྡེ་ཆེན་པོ་དེའི་མདུན་ན་འདོན་བྲམ་ཟེ་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་དང་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞིག་འདུག་པ་དེ་ཡུལ་ཐམས་ཅད་དུ་བཀུར་སྟི་བྱ་བ་དང་བླ་མར་བྱ་བ་དང་རི་མོར་བྱ་བ་དང་མཆོད་པར་བྱ་བ་དང་དགྲ་བཅོམ་པར་བཀུར་བར་གྱུར་ཏེ
en: King Mahā­sena’s magistrate was a certain brahmin who was capable, clear-minded, and trustworthy, with perfect understanding of the scriptures. In every quarter he was held in high esteem, revered, honored, venerated, and admired.

source: རྙེད་པའི་མཆོག་དང་གྲགས་པའི་མཆོག་དང་ལྡན་པར་གྱུར་ཏོ། །
en: His profit was unrivaled, his acclaim without compare.

source: དེའི་ཚེ་ནགས་ཁྲོད་ཞིག་ན་དྲང་སྲོང་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་ཞིག་གནས་ཏེ།
en: “At that time a certain sage who had a retinue of five hundred was living in the forest.

source: དེ་ལ་བྲམ་ཟེའི་ཁྱེའུ་མཁས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ་དང་བསྟན་བཅོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཉིས་ཤིག་འཁོད་དོ། །
en: There two young brahmins who were capable, clear-minded, and trustworthy, with perfect understanding of the scriptures, took up residence.

source: དེ་ནས་ཕྱི་ཞིག་ན་དྲང་སྲོང་དེས་བསམས་པ་བདག་གིས་དཀའ་ཐུབ་ཀྱི་ཚལ་འདི་ན་འདུག་བཞིན་དུ་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པར་བྱེད་མི་ནུས་ཀྱིས་མ་ལ་བདག་གིས་གྲོང་འདབ་ཏུ་གནས་བཅའ་བར་བྱའོ་སྙམ་ནས
en: “One day the sage thought, ‘So long as I remain here in this forest devoted to austerities, I’m of help to almost no one. I will settle near the city!’

source: གནས་དེ་ཉིད་ནས་ཐག་མི་རིང་བ་ཞིག་ཏུ་ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་པོ་ཕུབ་ནས་འདུག་སྟེ།
en: So, he fashioned a hut of branches nearby, and there he stayed,

source: དེ་དེ་ན་བཀུར་སྟི་བྱ་བ་དང་བླ་མར་བྱ་བ་དང་རི་མོར་བྱ་བ་དང་མཆོད་པ་བྱ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: held in high esteem, revered, honored, and venerated.

source: དེ་ནས་དྲང་སྲོང་དེ་ཡང་རྒས་ནས་གནས་དེ་དག་ཏུ་འགྲོ་མི་ནུས་སོ། །
en: Yet in time, as the sage got older, he was unable to go to the city anymore.

source: དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་དེ་གཉིས་ནི་དེར་འགྲོ་ཞིང་རྒྱལ་པོ་རྣམས་དང་། བློན་པོ་ཆེན་པོ་རྣམས་དང་ཕྱུག་པོ་རྣམས་དང་ཁྱིམ་བདག་རྣམས་དང་ཕོ་བྲང་འཁོར་གྱི་མི་རྣམས་དང་ཚོང་དཔོན་རྣམས་དང་དེད་དཔོན་རྣམས་ཀྱི་ཐད་དུ་འགྲོ་སྟེདེ་གཉིས་དེར་བཀུར་སྟི་བྱ་བ་དང་བླ་མར་བྱ་བ་དང་རི་མོར་བྱ་བ་དང་མཆོད་པར་བྱ་བ་དང་དགྲ་བཅོམ་པར་བཀུར་བར་གྱུར་ཏོ། །
en: When that time came, the two young brahmins would go there in his stead, and they were held in high esteem, revered, honored, venerated, and admired by the local royalty, the high officials, the wealthy, the householders, those in the king’s retinue, the merchants, and the sea captains.

source: དེ་ནས་ཕྱི་ཞིག་ན་མདུན་ན་འདོན་དེའི་སེམས་སྐྱེས་པ།
en: “This went on until one day Mahā­sena’s brahmin magistrate thought,

source: སྔོན་བདག་ཡུལ་འདི་ཐམས་ཅད་དུ་བཀུར་སྟི་བྱ་བ་དང་བླ་མར་བྱ་བ་དང་རི་མོར་བྱ་བ་དང་མཆོད་པ་བྱ་བའི་གནས་ཡིན་ནད་ནི་བདག་གི་རྙེད་པ་དང་བཀུར་སྟི་གང་ཡིན་པ་དེ་བྲམ་ཟེའི་ཁྱེའུ་འདི་གཉིས་ལ་འཕོས་ན།
en: ‘Before, I was held in high esteem throughout the land, revered, honored, venerated, and admired, and now all that profit and acclaim has been handed over to these two young brahmins instead.

source: ད་ཡང་འདི་གཉིས་མེད་ན་ནི་ཕྱིར་ཡང་བདག་གི་རྙེད་པ་དང་བཀུར་སྟི་སྔ་མཁོ་བཞིན་དུ་འོང་བར་འགྱུར་གྱིས་བདག་གིས་འདི་གཉིས་ལ་ཡང་དག་པ་མ་ཡིན་པའི་ཁ་ཕྱར་བཏང་བ་དང་།
en: When they’re no longer here, all my profit and acclaim will be restored. I will spread malicious rumors about them both, and then,

source: དེ་གཉིས་བསྙེན་བཀུར་མེད་པར་འགྱུར་དུ་དོགས་པས་གུད་དུ་འགྲོ་བར་འགྱུར་རོ་སྙམ་ནས
en: when those two suspect that they will no longer be served, they will take themselves elsewhere.’

source: མདུན་ན་འདོན་དེས་ཐོག་ཐག་ཏུ་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱར་ཀ་བཏང་སྟེ། འདི་གཉིས་ནི་འདོད་པ་ལ་སྤྱོད་པ་ཡིན་གྱི།
en: “So the magistrate spread rumors, saying, ‘Those two are indulging their desires.

source: འདི་གཉིས་ནི་ཚངས་པར་སྤྱོད་པ་མ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: They’re not celibate.’

source: དེ་ནས་དེ་གཉིས་ཀྱི་ཡང་དག་པ་མ་ཡིན་པའི་སྐུར་པ་དེ་དྲང་སྲོང་དེས་མཐོང་ནས་མདུན་ན་འདོན་དེ་བཀག་སྟེ།
en: When the sage heard the slanderous deprecations being made about these two, he challenged the magistrate, saying,

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་འདི་གཉིས་ལ་སེམས་སྡང་བར་མ་བྱེད་ཅིག །ཁྱོད་ཡུན་རིང་པོར་གནོད་པ་དང་མི་ཕན་པ་དང་། སྡུག་བསྔལ་བར་གྱུར་ཏ་རེ་ཞེས་བྱས་སོ། །
en: ‘Brahmin, you should not be so hateful toward these two young brahmins, for harm will befall you for a long time, and you will not benefit, but suffer.’

source: དེ་ལྟར་དྲང་སྲོང་དེས་དེ་ཡང་དང་ཡང་དུ་བཀག་ཀྱང་བཟློག་པར་མ་ནུས་ནས་དེས་དེ་གཉིས་ལ་སེམས་སྡང་བར་བྱས་པས་སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ཏོ། །
en: Though he tried again and again, the sage could neither stop nor sway him. Hateful toward them both, he fell among the hell beings.

source: དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་རྒན་པོར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: I am the one who was that sage then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུར་གྱུར་པ་གང་ཡིན་པ་དེ་གཉིས་ནི་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་འདི་གཉིས་ཁོ་ན་ཡིན་ནོ། །
en: Those who were the young brahmins then are none other than these two, Śāriputra and Maudgalyāyana.

source: དེའི་ཚེ་མདུན་ན་འདོན་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ཀོ་ཀ་ལི་ཀ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was that magistrate then is none other than Kokālika.

source: དེའི་ཚེ་ཡང་འདི་ངས་བཀག་བཞིན་དུ་འདི་གཉིས་ལ་སེམས་སྡང་བར་བྱས་པས་སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ཏོ། །
en: At that time, though I tried to stop him, he was hateful toward them both and fell among the hell beings.

source: ད་ལྟར་ཡང་ངས་བཀག་བཞིན་དུ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་སེམས་སྡང་བར་བྱས་པས་སེམས་ཅན་དམྱལ་བར་གཞོལ་བར་གྱུར་ཏོ། །
en: Now as well, though I tried to stop him, he has been hateful toward Śāriputra and Maudgalyāyana, and has fallen among the hell beings.”

source: བཙུན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱིས་ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་དགེ་སློང་དེས་མང་པོའི་ནང་དུ་བདེན་པ་མ་ལགས་པ་དང་ཡང་དག་པ་མ་ལགས་པ་དང་གསོག་དང་རྫུན་གྱི་ཚིག་དང་གཞི་མ་མཆིས་པར་ཕམ་པའི་ཆོས་ཀྱིས་སྐུར་པ་བཏབ་ལགས།
en: “what action did Śāriputra and Maudgalyāyana take that ripened into such untrue, malicious, worthless, spurious, unfounded, and destructive aspersions being cast on them?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་གཉིས་ཀྱིས་སྔོན་གྱི་ལས་བྱས་ཤིང་བསགས་པ་རྣམས་ནི་ཕྱི་རོལ་གྱི་སའི་ཁམས་ལ་རྣམ་པར་སྨིན་པར་མི་འགྱུར།
en: “Monks,” the Blessed One replied, “the actions these two committed and accumulated did not ripen into the external element of earth.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་གྲོང་ཁྱེར་རྡུལ་ལྡན་ཞེས་བྱ་བའི་གནས་གཅིག་ཅིག་ན། དཀའ་ཐུབ་ཅན་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་གཉིས་ཤིག་འཁོད་དེ།
en: “Monks, in times past a certain two ascetics, each with a retinue of five hundred, took up residence in two different parts of the city of Pāṁśula.

source: གྲོང་ཁྱེར་དེ་ན་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱ་བ་དང་བླ་མར་བྱ་བ་དང་རི་མོར་བྱ་བ་དང་མཆོད་པར་བྱ་བ་དང་དགྲ་བཅོམ་པར་བཀུར་བར་གྱུར་ཏེ།
en: All the people of the city held them in high esteem, accepted them as gurus, and honored, venerated, and respected them as arhats.

source: དེའི་ཚེ་རིའི་སུལ་ཞིག་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྫུ་འཕྲུལ་ཆེ་བ་མཐུ་ཆེ་བ་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་ཞིག་གནས་ཏེ།
en: “At that time in a certain mountain ravine there lived a sage who was clairvoyant, a person of great miracles and great power, who also had a retinue of five hundred.

source: དེ་ཡང་བདག་ཉིད་ཆེ་བ་བྱམས་པའི་བདག་ཉིད་ཅན་སྙིང་རྗེ་དང་ལྡན་པ།
en: He was also a great being, of a loving nature, and compassionate.

source: སེམས་ཅན་ལ་མཉེས་གཤིན་པ་སེམས་ཅན་ལ་ཕན་པ་ལ་ཞུགས་པ་ཞིག་སྟེ།
en: He cared deeply for beings and was committed to their welfare.

source: དེས་བསམས་པ།
en: He thought,

source: དགོན་པའི་གནས་ན་འདུག་བཞིན་དུ་ནི་བདག་གིས་སེམས་ཅན་ལ་ཕན་པར་བྱེད་མི་ནུས་ཀྱིས།
en: ‘So long as I stay in this hermitage, I’m of no help to others,

source: མ་ལ་བདག་གྲོང་ཁྱེར་རྡུལ་ལྡན་དུ་རྟེན་བཅས་ཏེ་
en: so I will gain support in the city of Pāṁśula and live there!

source: འདུག་པར་བྱ་གོར་མ་ཆག་བདག་དེར་འདུག་པ་དང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཕན་པར་བྱེད་ནུས་པར་འགྱུར་རོ་སྙམ་ནས་
en: By living there I shall certainly be able to help many.’

source: དགོན་པའི་གནས་དེར་ཇི་སྲིད་དུ་དགའ་བ་དེ་སྲིད་དུ་གནས་ནསགཡོག་འཁོར་ལྔ་བརྒྱ་དང་ཆས་ཏེ།
en: Having stayed in the hermitage for as long as he cared to, he set out with his retinue of five hundred.

source: རི་དགས་ཀྱི་པགས་པ་དང་ཤིང་ཤུན་གྱི་གོས་དང་འཁར་བ་དང་རིལ་བ་དང་དགང་གཟར་དང་བླུགས་གཟར་རྣམས་ཁྱེར་ཏེ་གྲོང་ཁྱེར་རྡུལ་ལྡན་དུ་ཕྱིན་ནས།
en: He walked to the city of Pāṁśula carrying clothes of deerskin and tree bark, a walking stick, a small water pitcher, and his ritual ladles.

source: དེ་ནགས་ཁྲོད་ཅིག་ཏུ་གནས་བཅས་ཏེ་ཡལ་ག་དང་ལོ་མའི་སྤྱིལ་པོ་ཕུབ་ནས་འདུག་གོ། །
en: He fashioned a hut of branches deep in the forest, and there he stayed.

source: དེ་ནས་གྲོང་ཁྱེར་རྡུལ་ལྡན་ན་གནས་པའི་སྐྱེ་བོ་མང་པོས་དེ་ལུས་མཛེས་པ་དང་སེམས་མཛེས་པ་དང་གཡོག་འཁོར་མཛེས་པར་མཐོང་ངོ་། །
en: “The many inhabitants of the city of Pāṁśula saw the elegance of his body, the elegance of his mind, and the elegance of those who attended him,
